{"sections":{"main":{"type":"page-affiliate-program","blocks":{"c730b74c-0b27-4f9d-aa4b-661f6a75a093":{"type":"banner","settings":{"banner":"shopify:\/\/shop_images\/PaliCrew.png","heading":"JOIN THE CREW","sub-heading":"","btn-one-text":"","btn-one-link":"","btn-two-text":"Apply","btn-two-link":"https:\/\/palicrew.paliroots.com\/create-account\/","btn-three-text":"Login","btn-three-link":"https:\/\/palicrew.paliroots.com\/login","mobile_banner":"shopify:\/\/shop_images\/PaliCrewMobile.png"}},"fc5713fc-9a8c-4b6f-b35f-b386bb7797ff":{"type":"content","settings":{"content-text":"<p>Our goal is a brand that is authentic, culturally forward, and most importantly inclusive. We partner with creators and ambassadors across the world to help share our mission. Our crew of affiliates enjoy some great perks, but more importantly have the support of a brand with pieces crafted of the highest quality.<\/p>"}},"6a8385e0-b037-45fb-a678-67d6e9545968":{"type":"content","settings":{"content-text":"<p>To get started with our Affiliate Program, you need to apply by clicking the 'Apply' button above. After submitting your application, our team will review it. If approved, you'll receive a unique discount code and be assigned a dedicated affiliate success manager to help you with any questions or concerns!<\/p>"}},"6b7baebf-c2f3-4058-b5eb-98641e63b6ad":{"type":"faq","settings":{"heading":"","faq1":"WHAT IS A PALICREW AFFILIATE?","richtext1":"<p>PaliCrew Affiliates are more than just partners; they're family. These passionate individuals help amplify the PaliRoots message, celebrating Palestinian culture while earning rewards. They're driven, engaged in their online communities, and committed to making a difference.<\/p>","faq2":"DO I NEED HAVE A LARGE FOLLOWING TO BE AN AFFILIATE?","richtext2":"<p>Not at all! While having a broad reach can help, we value passion, authenticity, and genuine engagement over numbers. If you have a heartfelt connection with our mission and can communicate that to others, you're what we're looking for. Don’t worry, we have a dedicated Affiliate Team that will guide you to success. <\/p>","faq3":"WHAT IF I'M NOT EARNING COMMISSIONS, WHAT HELP CAN I GET FROM PALIROOTS?","richtext3":"<p>We're here to support you at every step! If you're facing challenges in earning commissions, we offer a range of resources to help. This includes promotional materials, tips on sharing and engaging with your audience, and one-on-one support from our dedicated Affiliate Team. We want to ensure you're well-equipped to succeed with us.<\/p>","faq4":"HOW WILL I RECEIVE MY EARNINGS FROM THE AFFILIATE PROGRAM?","richtext4":"<p>To streamline the process, we disburse affiliate commissions via PayPal. It's essential to have a PayPal account when signing up for our affiliate program. If you haven't already, you can easily set one up at paypal.com.<br\/><\/p>","view":"","link":""}}},"block_order":["c730b74c-0b27-4f9d-aa4b-661f6a75a093","fc5713fc-9a8c-4b6f-b35f-b386bb7797ff","6a8385e0-b037-45fb-a678-67d6e9545968","6b7baebf-c2f3-4058-b5eb-98641e63b6ad"],"settings":{"title":""}}},"order":["main"]}